Revit 2027 API
StructuralWallUsageFilter(StructuralWallUsage, Boolean) Constructor
 Constructs a new instance of a filter to match walls that have the given structural wall usage, with the option to match all walls which are not of the given structural wall usage.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralWallUsageFilter(
	StructuralWallUsage structuralWallUsage,
	bool inverted
)
Public Sub New (
	structuralWallUsage As StructuralWallUsage,
	inverted As Boolean
)
public:
StructuralWallUsageFilter(
	StructuralWallUsage structuralWallUsage,
	bool inverted
)
new :
        structuralWallUsage : StructuralWallUsage *
        inverted : bool -> StructuralWallUsageFilter
Parameters
structuralWallUsage StructuralWallUsage
 The structural usage to match.
inverted Boolean
 True if the filter should match all walls which are not of the given structural wall usage.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
StructuralWallUsageFilter Class
StructuralWallUsageFilter Overload
Autodesk.Revit.DB.Structure Namespace